In [52]:
import numpy as np
import pandas as pd

In [53]:
dict_1 = {"Isim": ["Osman", "Kagan", "Recep", "Melih"],
          "Spor": ["Yüzme", "Kosu", "Basketbol", "Kosu"],
          "Kalori": [200, 150, 300, 250]
         }

In [54]:
dict_1

{'Isim': ['Osman', 'Kagan', 'Recep', 'Melih'],
 'Spor': ['Yüzme', 'Kosu', 'Basketbol', 'Kosu'],
 'Kalori': [200, 150, 300, 250]}

In [55]:
data_frame_1 = pd.DataFrame(dict_1, index=[0,1,2,3])

In [56]:
data_frame_1

    Isim       Spor  Kalori
0  Osman      Yüzme     200
1  Kagan       Kosu     150
2  Recep  Basketbol     300
3  Melih       Kosu     250

In [57]:
dict_2 = {"Isim": ["Hamdi", "Ahmet", "Fatma", "Melike"],
          "Spor": ["Kosu", "Yüzme", "Basketbol", "Futbol"],
          "Kalori": [250, 200, 120, 220]
         }

In [58]:
dict_2

{'Isim': ['Hamdi', 'Ahmet', 'Fatma', 'Melike'],
 'Spor': ['Kosu', 'Yüzme', 'Basketbol', 'Futbol'],
 'Kalori': [250, 200, 120, 220]}

In [59]:
data_frame_2 = pd.DataFrame(dict_2, index=[4,5,6,7])

In [60]:
data_frame_2

     Isim       Spor  Kalori
4   Hamdi       Kosu     250
5   Ahmet      Yüzme     200
6   Fatma  Basketbol     120
7  Melike     Futbol     220

In [61]:
dict_3 = {"Isim": ["Busra", "Isıl", "Hatice", "Emir"],
          "Spor": ["Tenis", "Yüzme", "Tenis", "Masa Tenisi"],
          "Kalori": [350, 130, 300, 400]
         }

In [62]:
dict_3

{'Isim': ['Busra', 'Isıl', 'Hatice', 'Emir'],
 'Spor': ['Tenis', 'Yüzme', 'Tenis', 'Masa Tenisi'],
 'Kalori': [350, 130, 300, 400]}

In [63]:
data_frame_3 = pd.DataFrame(dict_3, index=[8,9,10,11])

In [64]:
data_frame_3

      Isim         Spor  Kalori
8    Busra        Tenis     350
9     Isıl        Yüzme     130
10  Hatice        Tenis     300
11    Emir  Masa Tenisi     400

## CONCATENATION

In [65]:
pd.concat([data_frame_1, data_frame_2, data_frame_3], axis=0)

      Isim         Spor  Kalori
0    Osman        Yüzme     200
1    Kagan         Kosu     150
2    Recep    Basketbol     300
3    Melih         Kosu     250
4    Hamdi         Kosu     250
5    Ahmet        Yüzme     200
6    Fatma    Basketbol     120
7   Melike       Futbol     220
8    Busra        Tenis     350
9     Isıl        Yüzme     130
10  Hatice        Tenis     300
11    Emir  Masa Tenisi     400

In [66]:
pd.concat([data_frame_1, data_frame_2, data_frame_3], axis=1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Osman,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Kagan,Kosu,150.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Recep,Basketbol,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Melih,Kosu,250.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Hamdi,Kosu,250.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Ahmet,Yüzme,200.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Fatma,Basketbol,120.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Melike,Futbol,220.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Busra,Tenis,350.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Isıl,Yüzme,130.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Hatice,Tenis,300.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Emir,Masa Tenisi,400.0

## MERGE

In [82]:
merge_dict_1 = {"Isim": ["Gulce", "Yusra", "Hasan", "Fatih"],
                "Spor": ["Kosu", "Yüzme", "Badminton", "Tenis"]
               }

In [83]:
merge_data_frame_1 = pd.DataFrame(merge_dict_1)

In [84]:
merge_data_frame_1

    Isim       Spor
0  Gulce       Kosu
1  Yusra      Yüzme
2  Hasan  Badminton
3  Fatih      Tenis

In [90]:
merge_dict_2 = {"Isim": ["Gulce", "Yusra", "Hasan", "Fatih"],
                "Kalori": [200, 300, 150, 250]
               }

In [91]:
merge_data_frame_2 = pd.DataFrame(merge_dict_2)

In [92]:
merge_data_frame_2

    Isim  Kalori
0  Gulce     200
1  Yusra     300
2  Hasan     150
3  Fatih     250

In [93]:
merged_data_frame = pd.merge(merge_data_frame_1,merge_data_frame_2,on="Isim")

In [94]:
merged_data_frame

    Isim       Spor  Kalori
0  Gulce       Kosu     200
1  Yusra      Yüzme     300
2  Hasan  Badminton     150
3  Fatih      Tenis     250

In [99]:
salary_dictionary = {"Isim:": ["Gulce", "Yusra", "Hasan", "Fatih"],
                     "Departman": ["Yazılım", "Tasarim", "Hukuk", "Yazılım"],
                     "Maas": [30000, 23000, 27000, 24000]
                    }

In [100]:
salary_data_frame = pd.DataFrame(salary_dictionary)

In [101]:
salary_data_frame

   Isim: Departman   Maas
0  Gulce   Yazılım  30000
1  Yusra   Tasarim  23000
2  Hasan     Hukuk  27000
3  Fatih   Yazılım  24000

In [102]:
salary_data_frame["Departman"].unique()

array(['Yazılım', 'Tasarim', 'Hukuk'], dtype=object)

In [103]:
salary_data_frame["Departman"].nunique()

3

In [104]:
salary_data_frame["Departman"].value_counts()

Departman
Yazılım    2
Tasarim    1
Hukuk      1
Name: count, dtype: int64

In [108]:
def grossToNet(maas):
    return maas * 0.66

In [109]:
salary_data_frame["Maas"]

0    30000
1    23000
2    27000
3    24000
Name: Maas, dtype: int64

In [110]:
salary_data_frame["Maas"].apply(grossToNet)

0    19800.0
1    15180.0
2    17820.0
3    15840.0
Name: Maas, dtype: float64

In [111]:
salary_data_frame.isnull()

   Isim:  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [118]:
new_data_set = {"Karakter Sinifi": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
                "Karakter Ismi": ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
                "Karakter Yas": [9, 10, 50, 20, 10]
               }

In [119]:
new_data_frame = pd.DataFrame(new_data_set)

In [120]:
new_data_frame

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [122]:
new_data_frame.pivot_table(values="Karakter Yas", index=["Karakter Sinifi", "Karakter Ismi"])

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [123]:
new_data_frame.pivot_table(values="Karakter Yas", index=["Karakter Sinifi", "Karakter Ismi"], aggfunc=np.sum)

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10